public class Main {
    public static void main(String[] args) {
        //Створити порожній проект в IntelliJ
        //Створити клас "Співробітник" з полями: ПІБ, посада, email, телефон, вік.
        //Конструктор класу повинен заповнювати ці поля під час створення об'єкта. Забезпечити інкапсуляцію внутрішніх властивостей класу.
        //Створити клас Car з публічним методом start(). Метод start() викликає у собі методи:
        //startElectricity()
        //startCommand()
        //startFuelSystem()
        //Перелічені методи, є внутрішньою (прихованою) частиною комплексного методу start(). Вони по суті відображають внутрішню поведінку класу **Car** і не повинні використовуватися за межами даного класу.
        //Залийте виконаний проект на свій GitHub репозиторій, посилання на який зазначте в LMS.

        //Achtung! Код нижче для зручності перевірки виконаної роботи
        Employee Jack = new Employee("123@gmail.com", "Jack Johnson", "+300303030", "Programmer", 28);
        System.out.println(Jack);

        Car.Start();
    }
}